#Область ПрограммныйИнтерфейс

// Возвращает декларативный реестр сценариев регистрации по объектам метаданных.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - ОбъектМетаданных - объект метаданных источника регистрации.
//   * Значение - Массив - сценарии регистрации объекта.
Функция РеестрКонвейеровРегистрации() Экспорт
	
	РеестрСценариев = Новый Соответствие;
	
	//СценарииТоваров = Новый Массив;
	//СценарииТоваров.Добавить(СценарийРегистрацииТоваров());
	//РеестрСценариев[Метаданные.Справочники.Демо_КОД_Товары] = СценарииТоваров;
	//
	//СценарииЗаказов = Новый Массив;
	//СценарииЗаказов.Добавить(СценарийРегистрацииЗаказов());
	//РеестрСценариев[Метаданные.Документы.Демо_Заказ] = СценарииЗаказов;
	
	Возврат РеестрСценариев;
	
КонецФункции

// Возвращает сведения о внешней обработке для регистрации в подсистеме
// дополнительных отчетов и обработок.
//
// Возвращаемое значение:
//  Структура - параметры регистрации внешней обработки.
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	//ПараметрыРегистрации =
	//	ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(
	//		СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	//
	//ПараметрыРегистрации.Вид =
	//	ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	//ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	//ПараметрыРегистрации.Версия = "1.0";
	//
	//Возврат ПараметрыРегистрации;
	
КонецФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создает сценарий регистрации.
//
// Возвращаемое значение:
//  ФиксированнаяСтруктура - описание конвейера, обработчиков и кодов узлов.
Функция СценарийРегистрацииЗаказов()
	
	Обработчики = Новый Массив;
	КодыУзлов = Новый Массив; //возможно сразу жестко заложить перечень узлов к работе с регистрацией
	
    //Пример заполнения
	//Обработчики.Добавить(Метаданные.Обработки.Демо_КОД_Обработчик_ФильтрЗаказов);
	//Обработчики.Добавить(Метаданные.Обработки.Демо_КОД_Обработчик_МаршрутизаторЗаказов);
	//Обработчики.Добавить(Метаданные.Обработки.Демо_КОД_Обработчик_СвязаннаяРегистрацияТоваров);
	//Обработчики.Добавить(Метаданные.Обработки.Демо_КОД_Обработчик_ЗаказыВJSON);
	//Обработчики.Добавить(Метаданные.Обработки.Демо_КОД_Обработчик_ОтправительСообщенияВОчередь);
	//	
	//КодыУзлов.Добавить("WEB");
	
	СтруктураСценарий = Новый Структура;
	СтруктураСценарий.Вставить("Конвейер", Метаданные.Обработки.КОД_КонвейерОбработчиковБазовый);
	СтруктураСценарий.Вставить("Обработчики", Обработчики);
	СтруктураСценарий.Вставить("КодыУзлов", КодыУзлов);

	Возврат Новый ФиксированнаяСтруктура(СтруктураСценарий);
	
КонецФункции

#КонецОбласти
