&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ВызыватьИсключение = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСообщение(Команда)

	ДанныеСтроки = Элементы.Список.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ДанныеСтроки.Свойство("ГруппировкаСтроки") Тогда
		Возврат;
	КонецЕсли;

	КлючСообщения = Новый Структура("НомерСообщения, Идентификатор",
		ДанныеСтроки.НомерСообщения, ДанныеСтроки.Идентификатор);
	ЗагрузитьСообщениеНаСервере(КлючСообщения, ВызыватьИсключение);
	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьСообщениеНаСервере(КлючСообщения, ВызыватьИсключение)

	КОД_ДиспетчерЗагрузкиСообщений.ПрочитатьВходящуюОчередьСообщений(ВызыватьИсключение, КлючСообщения);

КонецПроцедуры
