// Дополняет соответствие планов обмена и реестров сценариев регистрации.
//
// Параметры:
//   РеестрыПоПланамОбмена - Соответствие из КлючИЗначение:
//     * Ключ - ОбъектМетаданныхПланОбмена - план обмена.
//     * Значение - ОбъектМетаданныхОбработка - обработка, реализующая реестр сценариев регистрации.
//
Процедура РеестрыСценариевПоПланамОбмена(РеестрыПоПланамОбмена) Экспорт
	
	//РеестрыПоПланамОбмена[Метаданные.ПланыОбмена.Демо_КОД_ОбменСайтом] =
	//	Метаданные.Обработки.Демо_КОД_РеестрСценариев_ОбменССайтом;
	
КонецПроцедуры

// Позволяет переопределить экземпляр обработки, используемый компонентом framework.
//
// Параметры:
//   ОбработкаМета - ОбъектМетаданныхОбработка - объект метаданных обработки.
//   ОбработкаОбъект - ОбработкаОбъект - экземпляр обработки, который требуется использовать.
//
Процедура ПриПолученииОбъектаОбработки(ОбработкаМета, ОбработкаОбъект) Экспорт
	
	//ДопОбработка = НайтиДополнительнуюОбработку(ОбработкаМета);
	//
	//Если ЗначениеЗаполнено(ДопОбработка)
	//	И ДопОбработка.Публикация =
	//		Перечисления.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется Тогда
	//	
	//	ОбработкаОбъект = ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(
	//		ДопОбработка.Ссылка);
	//	
	//КонецЕсли;
	
КонецПроцедуры

// Возвращает дополнительную обработку, подключенную для замещения
// встроенной реализации компонента framework.
//
// Параметры:
//   ОбработкаМета - ОбъектМетаданныхОбработка - объект метаданных обработки,
//     для которой выполняется поиск внешней реализации.
//
// Возвращаемое значение:
//   - ВыборкаИзРезультатаЗапроса - данные найденной дополнительной обработки.
//   - Неопределено - если дополнительная обработка не найдена.
//
Функция НайтиДополнительнуюОбработку(ОбработкаМета)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка,
	//	|	ДополнительныеОтчетыИОбработки.Публикация КАК Публикация
	//	|ИЗ
	//	|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
	//	|ГДЕ
	//	|	ДополнительныеОтчетыИОбработки.ИмяОбъекта = &ИмяОбъекта
	//	|	И НЕ ДополнительныеОтчетыИОбработки.ПометкаУдаления
	//	|	И ДополнительныеОтчетыИОбработки.Публикация <> &ПубликацияОтключена";
	//
	//Запрос.УстановитьПараметр("ИмяОбъекта", ОбработкаМета.Имя);
	//Запрос.УстановитьПараметр(
	//	"ПубликацияОтключена",
	//	Перечисления.ВариантыПубликацииДополнительныхОтчетовИОбработок.Отключена);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если РезультатЗапроса.Пустой() Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//Выборка.Следующий();
	//
	//Возврат Выборка;
	
КонецФункции
