#Область Подписки_на_события

// Сохраняет состояние до записи для использования сценариями регистрации,
// которым требуется предыдущее состояние объекта.
//
// Параметры:
//   Источник - ДокументОбъект - записываемый документ.
//   Отказ - Булево - признак отказа от записи.
//   РежимЗаписи - РежимЗаписиДокумента - режим записи документа.
//   РежимПроведения - РежимПроведенияДокумента - режим проведения документа.
//
Процедура ОбменПередЗаписьюДокументы(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	Если Источник.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов")
		И Источник.ДополнительныеСвойства.ОтключитьМеханизмРегистрацииОбъектов Тогда 
		
		Возврат; 
	КонецЕсли;

	МенеджерВременныхТаблиц = КОД_ДиспетчерРегистрацииКОбмену
								.СоздатьМенеджерВременныхТаблицПредыдущейВерсииУниверсальный(Источник);
	
	КонтекстПередЗаписью = Новый Структура;
	КонтекстПередЗаписью.Вставить("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц);
	
	Источник.ДополнительныеСвойства.Вставить("ПередЗаписью", КонтекстПередЗаписью);

КонецПроцедуры

Процедура ОбменПриЗаписиДокументы(Источник, Отказ) Экспорт

	Если Источник.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов")
		И Источник.ДополнительныеСвойства.ОтключитьМеханизмРегистрацииОбъектов Тогда 
		
		Возврат; 
	КонецЕсли;

	МетаданныеОбъекта = Источник.Метаданные();
			
	МассивСсылок = ОбернутьВМассив(Источник.Ссылка);
	
	МенеджерВременныхТаблиц = Неопределено;
	ЕстьМВТ = Источник.ДополнительныеСвойства.Свойство("ПередЗаписью") 
		И Источник.ДополнительныеСвойства.ПередЗаписью.Свойство("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц);
	
	КОД_ДиспетчерРегистрацииКОбмену.ЗарегистрироватьПоРееструСценариев(
		МетаданныеОбъекта,
		МассивСсылок,
		МенеджерВременныхТаблиц);  
		
КонецПроцедуры

#КонецОбласти

#Область Служебные

Функция ОбернутьВМассив(Значение)
	
	Массив = новый Массив;
	Массив.Добавить(Значение);
	
	Возврат Массив;
	
КонецФункции

#КонецОбласти
