#Область ПрограммныйИнтерфейс

// КлючЗаписи содержит все измерения непериодического регистра.
// Возвращает менеджер записи или Неопределено, если запись уже удалена.
Функция ПрочитатьЗапись(КлючЗаписи) Экспорт

	Запись = РегистрыСведений.КОД_ОшибкиЗагрузкиСообщений.СоздатьМенеджерЗаписи();
	Запись.НомерСообщения = КлючЗаписи.НомерСообщения;
	Запись.Идентификатор = КлючЗаписи.Идентификатор;
	Запись.Сценарий = КлючЗаписи.Сценарий;
	Запись.content_type = КлючЗаписи.content_type;
	Запись.УзелОбмена = КлючЗаписи.УзелОбмена;
	Запись.Прочитать();

	Если НЕ Запись.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Запись;

КонецФункции

// Вызывается внутри транзакции перед чтением и изменением записи.
Процедура ЗаблокироватьЗапись(КлючЗаписи) Экспорт

	Блокировка = Новый БлокировкаДанных;
	Элемент = Блокировка.Добавить("РегистрСведений.КОД_ОшибкиЗагрузкиСообщений");
	Элемент.Режим = РежимБлокировкиДанных.Исключительный;
	Элемент.УстановитьЗначение("НомерСообщения", КлючЗаписи.НомерСообщения);
	Элемент.УстановитьЗначение("Идентификатор", КлючЗаписи.Идентификатор);
	Элемент.УстановитьЗначение("Сценарий", КлючЗаписи.Сценарий);
	Элемент.УстановитьЗначение("content_type", КлючЗаписи.content_type);
	Элемент.УстановитьЗначение("УзелОбмена", КлючЗаписи.УзелОбмена);
	Блокировка.Заблокировать();

КонецПроцедуры

Процедура ИзменитьСообщение(КлючЗаписи, НовоеСообщение) Экспорт

	Свойства = Новый Структура("Сообщение", Новый ХранилищеЗначения(НовоеСообщение, Новый СжатиеДанных(9)));
	ИзменитьЗапись(КлючЗаписи, Свойства);

КонецПроцедуры

Процедура ВзятьНаКонтроль(КлючЗаписи, Ответственный) Экспорт

	Свойства = Новый Структура("НаКонтроле, Ответственный", Истина, Ответственный);
	ИзменитьЗапись(КлючЗаписи, Свойства);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИзменитьЗапись(КлючЗаписи, Свойства)

	НачатьТранзакцию();

	Попытка
		ЗаблокироватьЗапись(КлючЗаписи);
		Запись = ПрочитатьЗапись(КлючЗаписи);

		Если Запись = Неопределено Тогда
			ВызватьИсключение "Запись ошибки уже удалена. Обновите список.";
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(Запись, Свойства);
		Запись.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

#КонецОбласти
