// Дополняет соответствие отправителей и реестров сценариев загрузки.
//
// Параметры:
//  РеестрыПоОтправителям - Соответствие из КлючИЗначение:
//    * Ключ - Строка - отправитель сообщения.
//    * Значение - ОбъектМетаданныхОбработка - реестр сценариев загрузки.
//
Процедура РеестрыСценариевПоОтправителям(РеестрыПоОтправителям) Экспорт

	// Добавьте соответствие кода отправителя прикладному реестру сценариев.

КонецПроцедуры

// Позволяет переопределить экземпляр обработки, используемый конвейером загрузки.
//
// Параметры:
//  ОбработкаМета - ОбъектМетаданныхОбработка - метаданные обработки.
//  ОбработкаОбъект - ОбработкаОбъект - экземпляр обработки, который требуется использовать.
Процедура ПриПолученииОбъектаОбработки(ОбработкаМета, ОбработкаОбъект) Экспорт

КонецПроцедуры

// Прикладное соответствие транспортного отправителя конкретному узлу плана обмена.
// Определите узел прикладного плана обмена по транспортному отправителю.
// Отправитель - Строка. УзелОтправитель - ПланОбменаСсылка, Неопределено (выход).
Процедура ПриОпределенииУзлаОтправителя(Отправитель, УзелОтправитель) Экспорт

	// Заполните УзелОтправитель ссылкой на узел прикладного плана обмена.

КонецПроцедуры
